app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---
        </div>
        <%= f.collection_select :category_id, Category.all, :id, :name, {prompt: 'Select Category'},{class: 'mt-2 form-select'}  %>