app/views/articles/index.html.erb

          </p>
          <%= show_vote_btn(article)%><em class="badge bg-primary mx-3"><%= article.votes.count.to_s + ' Vote(s)' %></em>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = $1  [["article_id", 19]]