app/views/articles/show.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = $1  [["article_id", 24]]
---
          <%= show_vote_btn(@article)%>
          <em class="badge bg-primary mx-3"><%= @article.votes.count.to_s + ' Vote(s)' %></em>