app/views/users/index.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  <div class=' featured col-12 d-flex justify-content-center'>
    <% featured_article = Article.find(Vote.group(:article_id).count.max_by{|k,v| v}[0])%>

SELECT "categories"."name" FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1  [["article_id", 22]]
---
        <div class='card-body'>
          <h5 class='card-title'><%= article.categories.pluck(:name)[0] %></h5>

SELECT COUNT(*) AS count_all, "votes"."article_id" AS votes_article_id FROM "votes" GROUP BY "votes"."article_id"
---
          </p>
          <%= show_vote_btn(article)%><em class="badge bg-primary mx-3"><%= article.votes.count.to_s + ' Vote(s)' %></em>