app/helpers/application_helper.rb

  def show_vote_btn(article)
    vote = Vote.find_by(article: article, user: current_user)
---
SELECT "votes".* FROM "votes" WHERE "votes"."article_id" = $1 AND "votes"."user_id" = $2 LIMIT $3  [["article_id", 13], ["user_id", 1], ["LIMIT", 1]]