app/helpers/users_helper.rb

  def show_featured
    output = ''
    featured_article = Article.featured
    if Article.none?
      output << '<h6><strong>You have no created articles. Get creating.</strong></h6>'
    elsif featured_article.nil?
      art = Article.ordered_by_most_recent.first
---
SELECT "articles".* FROM "articles" WHERE NOT (id = 23) LIMIT $1  [["LIMIT", 5]]

  def show_others
    output = ''
    Article.others.each do |article|
      next unless article.image.attached?

      output << "<div class='col-3'>
        <div class='other-article'>
          #{link_to(cl_image_tag(article.image.key, width: 600, crop: :scale), article_path(article))}
          <p>
            #{article.text.truncate_words(5)}
          </p>
          <h5 class=''>#{link_to(article.categories.pluck(:name)[0],
                                 category_path(article.categories.pluck(:id)[0]))} </h5>
---
SELECT "categories"."id" FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1  [["article_id", 22]]