app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC
---
  def index
    @articles = Article.all.ordered_by_most_recent

SELECT "categories".* FROM "categories"
---
  def new
    @article = current_user.articles.build
    @category_options = Category.all.map{ |c| [c.name, c.id] }