app/controllers/votes_controller.rb

  def create
    @vote = current_user.votes.new(article_id: params[:article_id])
    if @vote.save
---
INSERT INTO "votes" ("user_id", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["article_id", 24], ["created_at", "2021-04-16 18:09:49.805537"], ["updated_at", "2021-04-16 18:09:49.805537"]]

  def destroy
    vote = Vote.find_by(id: params[:id], user: current_user, article_id: params[:article_id])
    if vote
      vote.destroy
---
SELECT "votes".* FROM "votes" WHERE "votes"."id" = $1 AND "votes"."user_id" = $2 AND "votes"."article_id" = $3 LIMIT $4  [["id", 19], ["user_id", 1], ["article_id", 13], ["LIMIT", 1]]
DELETE FROM "votes" WHERE "votes"."id" = $1  [["id", 19]]