app/models/article.rb

  scope :featured, -> { Article.find(Vote.group(:article_id).count.max_by { |_k, v| v }[0]) }
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]

  scope :others, -> { Article.where.not('id = ?', Vote.group(:article_id).count.max_by { |_k, v| v }[0]).limit(5) }
---
SELECT COUNT(*) AS count_all, "votes"."article_id" AS votes_article_id FROM "votes" GROUP BY "votes"."article_id"