app/views/categories/show.html.erb

SELECT "categories"."name" FROM "categories" WHERE (id = '1')
---
  <ul class='double mr-0'>
    <% @article = Article.category(Category.where('id = ?', params[:id]).pluck(:name)[0])%>