app/views/layouts/application.html.erb

SELECT "categories".* FROM "categories" LIMIT $1  [["LIMIT", 4]]
---
          <% end %>
          <% Category.limit(4).each do |cat| %>